<?php
/**
 * Created by PhpStorm.
 * User: Katrin
 * Date: 01.04.2020
 * Time: 20:12
 */
?>

<h4 class="main-page-section-header">
    <span class="section-arrow-down">▼</span>
    <span class="section-arrow-up">▲</span> Определения</h4>

<div class="main-page-section-body">
    <dl>
        <dt>Абстракция</dt>
        <dd>
            Придание объекту концептуальных границ. Реализуется с помощью
            инкапсуляции, полиморфизма и наследования. Позволяет скрыть детали
            реализации, чтобы упростить использование объектов.
        </dd>

        <dt>Инкапсуляция</dt>
        <dd>
            Скрытие деталей реализации переменных аспектов кода и предоставление
            публичных методов для работы с объектом. Реализуется с помощью ключевых
            слов private, protected и public. Позволяет взаимодействовать с объектом
            через интерфейс, не вдаваясь в сложность его реализации.
        </dd>

        <dt>Наследование</dt>
        <dd>
            Описывание нового класса на основе уже существующего. Реализуется с помощью
            ключевого слова extends. Позволет обращаться к классу-наследнику так же, как
            к базовому классу.
        </dd>

        <dt>Полиморфизм</dt>
        <dd>
            Возможность объектов с одинаковой спецификацией иметь разную реализацию. Реализуется
            с помощью интерфейсов и абстрактных классов. Позволяет увеличить коэффициент
            повторного использования кода.
        </dd>
    </dl>
</div>
