<?php
/**
 * Created by PhpStorm.
 * User: Katrin
 * Date: 01.04.2020
 * Time: 20:15
 */
?>

<h4 class="main-page-section-header">
    <span class="section-arrow-down">▼</span>
    <span class="section-arrow-up">▲</span> Принципы проектирования</h4>

<div class="main-page-section-body">
    <ul>
        <li>Инкапсулируйте то, что изменяется</li>
        <li>Предпочитайте композицию наследованию</li>
        <li>Программируйте на уровне интерфейсов</li>
        <li>Стремитесь к слабой связности взаимодействующих объектов</li>
        <li>Классы должны быть открыты для расширения, но закрыты для изменения</li>
        <li>Код должен зависеть от абстракции, а не от конкретных классов</li>
        <li>Клиент должен общаться с минимальным количеством классов</li>
        <li>Подклассы не могут обращаться к родителю (вызывать его методы)</li>
        <li>Каждый класс должен иметь только одну обязанность и причину для изменения</li>
    </ul>
</div>
