<?php
/**
 * Created by PhpStorm.
 * User: Katrin
 * Date: 01.04.2020
 * Time: 20:24
 */
?>

<h4 class="main-page-section-header">
    <span class="section-arrow-down">▼</span>
    <span class="section-arrow-up">▲</span> Поведенческие</h4>

<div class="main-page-section-body">
    <dl>
        <dt>Цепочка обязанностей</dt>
        <dd>
            Поведенческий паттерн, позволяющий предоставить возможность обработки
            действия нескольким объектам. Каждый из таких объектов решает, обработать
            запрос или передать его дальше по цепочке.
        </dd>

        <dt>Интерпретатор</dt>
        <dd>
            Поведенческий паттерн, предназначенный для создания языковых
            интерпретаторов.
        </dd>

        <dt>Посредник</dt>
        <dd>
            Поведенческий паттерн, использующийся для централизации сложных взаимодействий
            между объектами в одном объекте-посреднике. Это позволяет уменьшить связность
            классов.
        </dd>

        <dt>Хранитель</dt>
        <dd>
            Поведенческий паттерн, использующийся для реализации сохранения одного из
            предыдущих состояний объекта для последующего возврата к нему.
        </dd>

        <dt>Посетитель</dt>
        <dd>
            Поведенческий паттерн, позволяющий добавить новое поведение к объектам уже
            сформированной архитектуры с помощью его вынесения в отдельный класс. Правда, в
            таком случае происходит нарушение инкапсуляции.
        </dd>
    </dl>
</div>
