<?php
/**
 * Created by PhpStorm.
 * User: Katrin
 * Date: 01.04.2020
 * Time: 20:28
 */
?>

<h4 class="main-page-section-header">
    <span class="section-arrow-down">▼</span>
    <span class="section-arrow-up">▲</span> Порождающие</h4>

<div class="main-page-section-body">
    <dl>
        <dt>Строитель</dt>
        <dd>Порождающий паттерн, инкапсулирующий конструирование сложного объекта
            и разбивающий это конструирование на шаги таким образом, чтобы с его
            помощью можно было построить разнообразные сложные структуры.
        </dd>

        <dt>Прототип</dt>
        <dd>Порождающий паттерн, позволяющий создавать копии объектов. Используется в тех
            случях, когда создание самого объекта требует больших затрат ресурсов и времени.
        </dd>
    </dl>
</div>
