<?php
/**
 * Created by PhpStorm.
 * User: Katrin
 * Date: 01.04.2020
 * Time: 20:27
 */
?>

<h4 class="main-page-section-header">
    <span class="section-arrow-down">▼</span>
    <span class="section-arrow-up">▲</span> Структурные</h4>

<div class="main-page-section-body">
    <dl>
        <dt>Заместитель</dt>
        <dd>Структурный паттерн, позволяющий управлять доступом к основному
            объекту с помощью объекта-заместителя, реализующего один с
            основным объектом интерфейс.
        </dd>

        <dt>Мост</dt>
        <dd>Структурный паттерн, разделяющий взаимодействующие друг с другом
            классы на отдельные иерархии для обеспечения их независимости. Это
            необходимо для того, чтобы вдальнейшем можно было безболезненно изменять
            их.
        </dd>

        <dt>Приспособленец</dt>
        <dd>Стуктурный паттерн, позволяющий предоставлять множество "виртуальных
            экземпляров" при помощи всего одного. Таким образом экономится оперативная
            память, так как все "виртуальные объекты" имеют одно общее состояние.
        </dd>
    </dl>
</div>
