<?php
/**
 * Created by PhpStorm.
 * User: Katrin
 * Date: 24.04.2020
 * Time: 23:44
 */
?>

<div class="page description-container" id="description">
    <div>
        <h2>Перед началом</h2>
        <div class="description">
            <p>
                Вы прошли основную часть тестирования, теперь перед вами заключительный этап -
                короткий тест из вопросов, касающихся основных функций прототипа.
                Он поможет определить минимальный рабочий функционал будущего приложения.
            </p>
            <p>
                Для каждой предложенной функции будет задаваться по 2 противоположных
                вопроса: "Как вы отнесетесь к тому, если в приложении будет эта функция?" и
                "Как вы отнесетесь к тому, если в приложении НЕ будет этой функции?".
            </p>
            <p>
                На каждом из вопросов будет по 5 вариантов ответа:
            </p>
            <ul>
                <li>Нравится (было бы круто иметь/не иметь эту функцию);</li>
                <li>Ожидаю этого (я как бы ожидаю, что эта функция будет/ее не будет в
                    продукте в любом случае)</li>
                <li>Все равно (наличие/отсутствие этой функции для меня не важно)</li>
                <li>Потерплю (ну, я не в восторге, но переживу)</li>
                <li>Не нравится (Дичь какая-то, я не буду этим пользоваться/эта функция
                    необходима)</li>
            </ul>
            <p>
                Отметьте, считаете ли вы предложенные функции желательными, обязательными или
                бесполезными, выбрав один из предложенных вариантов ответа.
            </p>
        </div>

        <button class="link" data-href="#question1">Начать</button>
    </div>
</div>
