<?php
/**
 * Created by PhpStorm.
 * User: Katrin
 * Date: 24.04.2020
 * Time: 23:44
 */
?>

<div class="page description-container" id="description">
    <div>
        <h2>Перед началом</h2>
        <div class="description">
            <p>
                Представьте себе приложение с виртуальным гардеробом, куда вы заносите
                свою одежду из реального мира. Затем из нее можно создавать и сохранять
                образы - вручную, или приложение сгенерирует их за вас. Полученные
                образы или отдельные вещи можно добавлять в календарь, чтобы
                спланировать свой выход куда-нибудь. Помимо этого приложение ведет
                статистику.
            </p>
            <p>
                Таким образом, оно позволяет систематизировать гардероб и проще находить
                удачные сочетания среди своей одежды. Поиграться с таким прототипом можно
                здесь.
            </p>
            <p>
                В данном опросе вам предстоит ответить на вопросы, касающиеся 23 основных
                функций приложения. Это поможет определить функционал минимально жизнеспособной
                версии продукта (MVP).
            </p>
        </div>

        <button class="link" data-href="#question1">Начать</button>
    </div>
</div>
