<?php
/**
 * Created by PhpStorm.
 * User: Katrin
 * Date: 05.05.2020
 * Time: 15:41
 */

$questions = [
    "Добавление нескольких фотографий одежды в гардероб за раз, а затем поочередное редактирование каждой из них",
    "Автоматическое вырезание фона у добавленной вещи и цветокоррекция (при нажатии на соответствующие кнопки)",
    "Добавление некоторых предметов одежды в Избранное",
    "Генерация образов из одежды вашего гардероба с учетом настраиваемых вами параметров (погоды, мероприятия, цвета вещей т.д.); при каждом нажатии на соответствующую кнопку генерируется новый образ",
    "Генерация образов на основе автоматически собираемых параметров (текущий сезон, погода); подбираются вещи, которые подходят в текущий момент",
    "Замена нескольких вещей в сгенерированном образе; удержание нескольких вещей, чтобы при следующей генерации эти вещи остались (если вам понравилась только часть вещей из подобранного образа)",
    "Добавление вещей в виртуальную стиральную машину (чтобы они не учитывались при генерации образа)",
    "Сохранение сгенерированного образа в так называемые \"Мои образы\"",
    "Добавление образов в Избранное",
    "Выбор сетки для расположения вещей при ручном создании образа",
    "Сравнение образов по параметрам (удачность образа, погода, мероприятие и т.д.)",
    "Сравнение вещей из виртуального гардероба по параметрам (материал, мероприятие, сезон и т.д.)",
    "Смена очередности вещей или образов в списках \"Гардероб\", \"Мои образы\" и \"Календарь\" (при помощи их перетаскивания)",
    "Фильтрация одежды и образов по сезону, мероприятию и т.д.",
    "Добавление образов и отдельных предметов одежды в календарь",
    "Перенос образов и отдельных предметов одежды на другую дату в календаре",
    "Возможность поделиться образами в соцсетях",
    "Ведение статистики по одежде и образам",
    "FAQ (часто задаваемые вопросы)",
    "Всплаывающие подсказки при первом знакомстве с приложением",
    "Форма обратной связи",
    "Выбор темы приложения",
    "Статьи о моде с рекомендациями стилистов по грамотному подбору одежды",
    "Виртуальная примерка образов, как масок в Инстаграм",
    "Выбор и покупка образов из магазинов, не выходя из дома",
];