<?php
/**
 * Created by PhpStorm.
 * User: Katrin
 * Date: 05.05.2020
 * Time: 15:41
 */

$questions = [
    "Добавление одежды в гардероб не по одной, а по несколько штук за раз",
    "Автоматические вырезание фона у добавленной вещи и цветокоррекция (при нажатии на соответствующие кнопки)",
    "Добавление некоторых предметов одежды в Избранное",
    "Генерация образов из одежды вашего гардероба с учетом погоды, мероприятия, цвета вещей т.д. (при каждом нажатии на соответствующую кнопку генерируется новый образ)",
    "Замена нескольких вещей в сгенерированном образе; удержание нескольких вещей, чтобы при следующей генерациии эти вещи остались (если вам понравилась только часть вещей из подобранного образа)",
    "Генерация образов с учетом текущего сезона (подбираются вещи, которые подходят под текущую погоду)",
    "Добавление вещей в виртуальную стиральную машину (чтобы они не учитывались при генерации образа)",
    "Сохранение сгенерированного образа в так называемые \"Мои образы\"",
    "Добавление образов в Избранное",
    "Выбор шаблона для расположения вещей при создании образа",
    "Сравнение образов",
    "Сравнение вещей из виртуального гардероба",
    "Смена очередности вещей или образов в списках 'Гардероб' и 'Мои образы' (при помощи их перетаскивания)",
    "Фильтрация одежды и образов по сезону, мероприятию и т.д.",
    "Добавление образов и отдельных предметов одежды в календарь для планирования",
    "Перенос образов и отдельных предметов одежды на другую дату в календаре",
    "Возможность поделиться образами в соцсетях",
    "Ведение статистики по одежде и образам",
    "FAQ (часто задаваемые вопросы)",
    "Руководство по использованию приложения",
    "Форма обратной связи",
    "Выбор темы приложения",
    "Статьи о моде с рекомендациями стилистов по грамотному подбору одежды",
    "Виртуальная примерка образов, как масок в Инстаграм",
    "Выбор и покупка образов из магазинов, не выходя из дома",
];